Revit 2027 API
BuiltInFailures.RebarShapeFailures.DimensionWithoutParameter Property
 Dimension has no parameter assigned to it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DimensionWithoutParameter { get; }
Public Shared ReadOnly Property DimensionWithoutParameter As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DimensionWithoutParameter {
	FailureDefinitionId^ get ();
}
static member DimensionWithoutParameter : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace